var dataLines = [
    {
        index: '1',
        name: '大脑的组织，主要是由80％的水组成 纯质的饮用水，才更容易上头 远洋健康生活家理念—“清洁质水” ',
        lines: [
            {x1: 406, y1: 308, x2: 471, y2: 119},
            {x1: 471, y1: 119, x2: 203, y2: 308},
            {x1: 203, y1: 308, x2: 144, y2: 119},
            {x1: 144, y1: 119, x2: 310, y2: 0},
            {x1: 310, y1: 0, x2: 406, y2: 308},
        ],
        dots: ["D1", "C2", "B3", "A1", "A3"]
    },
    {
        index: '2',
        name: '一个苹果的100％营养 是100％营养的1％ 远洋健康生活家理念—“丰沛营养” ',
        lines: [
            {x1: 406, y1: 308, x2: 471, y2: 119},
            {x1: 471, y1: 119, x2: 203, y2: 308},
            {x1: 203, y1: 308, x2: 144, y2: 119},
            {x1: 144, y1: 119, x2: 310, y2: 0},
            {x1: 310, y1: 0, x2: 406, y2: 308},
        ],
        dots: ["C1", "D1", "B1", "A1", "A2"]
    },
    {
        index: '3',
        name: '空气中21％的氧让人呼吸，1％的杂质让人不能呼吸 滤化更多杂质，让每一次呼吸都更健康 远洋健康生活家理念—“清新空气” ',
        lines: [
            {x1: 203, y1: 308, x2: 406, y2: 308},
            {x1: 406, y1: 308, x2: 144, y2: 119},
            {x1: 144, y1: 119, x2: 310, y2: 0},
            {x1: 310, y1: 0, x2: 471, y2: 119},
            {x1: 471, y1: 119, x2: 203, y2: 308},
        ],
        dots: ["C1", "B2", "A1", "A4", "C2"]
    },
    {
        index: '4',
        name: '让环境驯服意志 想安静时，得安静 远洋健康生活家理念—“精神” ',
        lines: [
            {x1: 406, y1: 308, x2: 310, y2: 0},
            {x1: 310, y1: 0, x2: 144, y2: 119},
            {x1: 144, y1: 119, x2: 471, y2: 119},
            {x1: 471, y1: 119, x2: 203, y2: 308},
            {x1: 203, y1: 308, x2: 406, y2: 308},
        ],
        dots: ["C1", "A3", "A1", "B1", "C2"]
    },
    {
        index: '5',
        name: '健身是1％的汗水 加99％的科学 远洋健康生活家理念—“科学健身” ',
        lines: [
            {x1: 406, y1: 308, x2: 471, y2: 119},
            {x1: 471, y1: 119, x2: 203, y2: 308},
            {x1: 203, y1: 308, x2: 310, y2: 0},
            {x1: 310, y1: 0, x2: 144, y2: 119},
            {x1: 114, y1: 119, x2: 406, y2: 308},
        ],
        dots: ["D1", "B2", "A1", "A2", "C2"]
    },
    {
        index: '6',
        name: '真正的舒适不是“随心所欲” 而是“有理有据” 远洋健康生活家理念—“舒适人居” ',
        lines: [
            {x1: 471, y1: 119, x2: 406, y2: 308},
            {x1: 406, y1: 308, x2: 144, y2: 119},
            {x1: 144, y1: 119, x2: 203, y2: 308},
            {x1: 203, y1: 308, x2: 310, y2: 0},
            {x1: 310, y1: 0, x2: 471, y2: 119},
        ],
        dots: ["B3", "A2", "A4", "D1", "B2"]
    },
    {
        index: '7',
        name: '看见自然光 让光污染不可见 远洋健康生活家理念—“自然生活光”',
        lines: [
            {x1: 310, y1: 0, x2: 471, y2: 119},
            {x1: 471, y1: 119, x2: 406, y2: 308},
            {x1: 406, y1: 308, x2: 203, y2: 308},
            {x1: 203, y1: 308, x2: 144, y2: 119},
            {x1: 144, y1: 119, x2: 301, y2: 0},
        ],
        dots: ["A4", "D1", "C1", "B3", "A1"]
    },
    {
        index: '8',
        name: '万和系精工匠制 打造张垣品质标杆',
        dots: ["A3", "B2", "B3", "C2", "A4"]
    },
    {
        index: '9',
        name: '万和系精工匠制 打造张垣品质标杆',
        dots: ["A2", "A3", "B2", "B1", "C2"]
    },
    {
        index: '10',
        name: '2022冬奥盛典 让世界聚焦冬奥之城 潜力，让张家口与众不同 ',
        dots: ["A4", "B1", "B3", "C1", "A3"]
    },
    {
        index: '11',
        name: '京张高铁40分钟联京北 再拓环京一小时生活圈',
        dots: ["C1", "A2", "A4", "B1", "B2"]
    },
    {
        index: '12',
        name: '我们走的越远 在不远洋的人眼中形象就越小',
        dots: ["B3", "A2", "A3", "D1", "B1"]
    }
]

